In [2]:
import numpy as np
import pandas as pd

# Series

In [4]:
# series has been created on top of numpy object

In [7]:
# diffrent ways to create a series

li_labels = ['a','b','c']
li_data = [1,2,3]
dict_data = {'a':'1','b':'2','c':'3'}

arr = np.array(li_data)

In [10]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int64

In [12]:
pd.Series(li_labels)

0    a
1    b
2    c
dtype: object

In [14]:
pd.Series(li_data,li_labels)

a    1
b    2
c    3
dtype: int64

In [16]:
pd.Series(dict_data)

a    1
b    2
c    3
dtype: object

# dataframes

In [17]:
from numpy.random import randn

In [18]:
np.random.seed(101)

In [20]:
df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['USA','IND','CHN','USSR'])

df

        USA       IND       CHN      USSR
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
df[['USA','IND']]

        USA       IND
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [23]:
df['USA']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: USA, dtype: float64

In [24]:
df['PAK'] = df['USA']+df['IND']

In [26]:
df

        USA       IND       CHN      USSR       PAK
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [29]:
df.drop('PAK',axis=1)

        USA       IND       CHN      USSR
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
df.drop('A')

        USA       IND       CHN      USSR       PAK
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [31]:
df.shape[0]

5

In [32]:
df.shape

(5, 5)

In [33]:
df.drop('PAK',axis=1,inplace=True)

In [35]:
df.shape

(5, 4)

In [36]:
df

        USA       IND       CHN      USSR
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [40]:
# location of the elements in dataframe

#both returns the same first one is on label based another one is on index number based
df.loc['A']
df.iloc[0]

USA     0.302665
IND     1.693723
CHN    -1.706086
USSR   -1.159119
Name: A, dtype: float64

USA     0.302665
IND     1.693723
CHN    -1.706086
USSR   -1.159119
Name: A, dtype: float64

In [39]:
# This code is for allow notebook to print multiple commands

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [41]:
df.loc['A','IND']

1.693722925204035

In [42]:
df.loc[['A','E'],['CHN']]

        CHN
A -1.706086
E  0.238127

In [44]:
df[df['USA']>0.1]

        USA       IND       CHN      USSR
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [47]:
df[df['IND']>1][['USA','USSR']]

        USA      USSR
A  0.302665 -1.159119
E -0.116773  1.996652

In [55]:
df[(df['IND'] > 1) & (df['USA'] > 0.1)]
df[(df['IND'] > 1) | (df['USA'] > 0.1)]

        USA       IND       CHN      USSR
A  0.302665  1.693723 -1.706086 -1.159119

        USA       IND       CHN      USSR
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [56]:
df

        USA       IND       CHN      USSR
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [57]:
df.set_index('USA')

                IND       CHN      USSR
USA
 0.302665  1.693723 -1.706086 -1.159119
-0.134841  0.390528  0.166905  0.184502
 0.807706  0.072960  0.638787  0.329646
-0.497104 -0.754070 -0.943406  0.484752
-0.116773  1.901755  0.238127  1.996652

In [59]:
df.reindex()

        USA       IND       CHN      USSR
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [62]:
df.set_index(['X C V B N'.split(' ')],inplace=True)

In [63]:
df

        USA       IND       CHN      USSR
X  0.302665  1.693723 -1.706086 -1.159119
C -0.134841  0.390528  0.166905  0.184502
V  0.807706  0.072960  0.638787  0.329646
B -0.497104 -0.754070 -0.943406  0.484752
N -0.116773  1.901755  0.238127  1.996652

# dataframe Index Levels

In [64]:
# multi level index

In [73]:
level1 = [1,2,3,1,2,3]
level2 = ['A','A','A','B','B','B']

mul_tup = list(zip(level2,level1))

In [74]:
mul_idx = pd.MultiIndex.from_tuples(mul_tup)

In [75]:
df = pd.DataFrame(randn(6,2),mul_idx,['USA','IND'])
df

          USA       IND
A 1  0.681209  1.035125
  2 -0.031160  1.939932
  3 -1.005187 -0.741790
B 1  0.187125 -0.732845
  2 -1.382920  1.482495
  3  0.961458 -2.141212

In [78]:
df.loc['A']

        USA       IND
1  0.681209  1.035125
2 -0.031160  1.939932
3 -1.005187 -0.741790

In [80]:
df.loc['A']['USA']

1    0.681209
2   -0.031160
3   -1.005187
Name: USA, dtype: float64

In [83]:
df.loc['A'].loc[2]

USA   -0.031160
IND    1.939932
Name: 2, dtype: float64

In [84]:
df.loc['A'].loc[3]['USA']

-1.005186917256266

In [85]:
d = {'num_legs': [4, 4, 2, 2],'num_wings': [0, 0, 2, 2],'class': ['mammal', 'mammal', 'mammal', 'bird'], 'animal': ['cat', 'dog', 'bat', 'penguin'],'locomotion': ['walks', 'walks', 'flies', 'walks']}

In [86]:
df = pd.DataFrame(data=d)

In [87]:
df

   num_legs  num_wings   class   animal locomotion
0         4          0  mammal      cat      walks
1         4          0  mammal      dog      walks
2         2          2  mammal      bat      flies
3         2          2    bird  penguin      walks

In [88]:
df = df.set_index(['class', 'animal', 'locomotion'])

In [89]:
df

                           num_legs  num_wings
class  animal  locomotion
mammal cat     walks              4          0
       dog     walks              4          0
       bat     flies              2          2
bird   penguin walks              2          2

In [90]:
df.xs('mammal')

                   num_legs  num_wings
animal locomotion
cat    walks              4          0
dog    walks              4          0
bat    flies              2          2

In [91]:
df.xs(('mammal', 'dog'))

/opt/conda/lib/python3.7/site-packages/IPython/core/interactiveshell.py:2886: PerformanceWarning: indexing past lexsort depth may impact performance.
  return runner(coro)

            num_legs  num_wings
locomotion
walks              4          0

In [92]:
df.xs('cat', level=1)

                   num_legs  num_wings
class  locomotion
mammal walks              4          0

In [93]:
df.xs(('bird', 'walks'),
      level=[0, 'locomotion'])

         num_legs  num_wings
animal
penguin         2          2

In [94]:
df.xs('num_wings', axis=1)

class   animal   locomotion
mammal  cat      walks         0
        dog      walks         0
        bat      flies         2
bird    penguin  walks         2
Name: num_wings, dtype: int64

# missing data

In [95]:
d = {'a':[1,2,3],'b':[np.nan,1,2],'c':[np.nan,2,np.nan]}

df = pd.DataFrame(d)

df

   a    b    c
0  1  NaN  NaN
1  2  1.0  2.0
2  3  2.0  NaN

In [96]:
df.dropna()

   a    b    c
1  2  1.0  2.0

In [97]:
df.dropna(axis=1)

   a
0  1
1  2
2  3

In [98]:
df.dropna(thresh=2)

   a    b    c
1  2  1.0  2.0
2  3  2.0  NaN

In [99]:
df.fillna('great')

   a      b      c
0  1  great  great
1  2      1      2
2  3      2  great

In [102]:
df.fillna(value=df['b'].mean())

   a    b    c
0  1  1.5  1.5
1  2  1.0  2.0
2  3  2.0  1.5

# group by

In [103]:
data  = {'company': ['google', 'infy',  'dfz', 'dfz', 'google'],'Employee':['dds','durga','prasad','dunga','sankara'],'salary':[126273,12763,12829,873463278,672432]}

In [104]:
data

{'company': ['google', 'infy', 'dfz', 'dfz', 'google'],
 'Employee': ['dds', 'durga', 'prasad', 'dunga', 'sankara'],
 'salary': [126273, 12763, 12829, 873463278, 672432]}

In [105]:
df = pd.DataFrame(data)
df

  company Employee     salary
0  google      dds     126273
1    infy    durga      12763
2     dfz   prasad      12829
3     dfz    dunga  873463278
4  google  sankara     672432

In [106]:
bycomp = df.groupby('company')

In [107]:
bycomp

In [108]:
bycomp.mean()

              salary
company
dfz      436738053.5
google      399352.5
infy         12763.0

In [109]:
bycomp.sum()

            salary
company
dfz      873476107
google      798705
infy         12763

In [111]:
df.groupby('company').sum().loc['dfz']

salary    873476107
Name: dfz, dtype: int64

In [114]:
df.groupby('company').describe().transpose()

company                dfz         google     infy
salary count  2.000000e+00       2.000000      1.0
       mean   4.367381e+08  399352.500000  12763.0
       std    6.176227e+08  386192.732506      NaN
       min    1.282900e+04  126273.000000  12763.0
       25%    2.183754e+08  262812.750000  12763.0
       50%    4.367381e+08  399352.500000  12763.0
       75%    6.551007e+08  535892.250000  12763.0
       max    8.734633e+08  672432.000000  12763.0

# Merging  Joining & Concatinating

In [115]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [116]:
df1
df2
df3

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [118]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [119]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [120]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [121]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [124]:
left
right

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [129]:
left.reindex()

      A   B
key
K0   A0  B0
K1   A1  B1
K2   A2  B2
K3   A3  B3

In [130]:
right.reindex()

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# JOINS
* you can only join on the indexed columns

In [134]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [135]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [136]:
left.join(right, how='inner')
left.join(right, how='outer')
left.join(right, how='left')
left.join(right, how='right')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

# Operations